# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [22]:
series1 = pd.Series(np.random.randint(1,5,size=100))
series2 = pd.Series(np.random.randint(1,4,size=100))
series3 = pd.Series(np.random.randint(10000,30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [23]:
df = pd.DataFrame(dict(series1 = series1, series2 = series2, series3 = series3))

In [24]:
df.head()

   series1  series2  series3
0        1        2    23441
1        4        2    23688
2        4        3    25935
3        3        3    27362
4        3        2    23752

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [25]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

In [26]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            23441
1      4       2            23688
2      4       3            25935
3      3       3            27362
4      3       2            23752

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [27]:
big_column = pd.concat([series1, series2, series3]).to_frame()

In [28]:
big_column.tail()

        0
95  17582
96  27991
97  23741
98  12412
99  22733

In [29]:
big_column.shape

(300, 1)

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [30]:
big_column = big_column.reset_index()

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [31]:
big_column.index

RangeIndex(start=0, stop=300, step=1)

In [32]:
big_column.tail()

     index      0
295     95  17582
296     96  27991
297     97  23741
298     98  12412
299     99  22733